# ValueType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Field..::..ValueType Property
Field Class See Also
---
The type of the values stored in the field.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Type ValueType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ValueType As Type
	Get
```

Visual C++
---
```text
public:
property Type^ ValueType {
	Type^ get ();
}
```

# Remarks
For key-value maps, this is the value type.
# See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace